src/InformationRegisters/ДоступностьСайта/ДоступностьСайта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоступностьСайта</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Доступность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.Публикации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ДоступностьИнформационныхБаз/ДоступностьИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоступностьИнформационныхБаз</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Доступность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
      <types>CatalogRef.АгентыКИП</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ДоступностьОборудования/ДоступностьОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоступностьОборудования</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Доступность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РабочийСервер</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Публикации/Публикации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Публикации</name>
  <attributes>
    <name>УдалитьЛогин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьТелоОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветДляСравнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьПеренаправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПроцентДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоНетДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаЭксплуатации</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаДляВосстановления</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Оборудование/Оборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Оборудование</name>
  <attributes>
    <name>АгентКИП</name>
    <type>
      <types>CatalogRef.АгентыКИП</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Архитектура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновленияИнформацииОСистеме</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоНетДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВнешнегоАгента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МакАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПроцентДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперационнаяСистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперационнаяСистемаВерсия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗаписи</name>
    <comment>Период записи данных в регистр сведений &quot;Текущие значения производительности&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗаписиПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаДляВосстановления</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаЭксплуатации</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьДоступность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьДампы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьДанныеПроизводительности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОС</name>
    <type>
      <types>EnumRef.ТипОС</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРоль</name>
    <type>
      <types>CatalogRef.РолиОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьСчетчикПоНаименованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯзыкОС</name>
    <type>
      <types>EnumRef.ЯзыкиСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьДанныеЛицензий1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияRing</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаUTCОбновленияЛицензий1С</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетчикиПроизводительности</name>
    <attributes>
      <name>СобиратьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
    <attributes>
      <name>Зафиксировать</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнешниеЦКК</name>
    <attributes>
      <name>ПередаватьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийЦКК</name>
      <type>
        <types>CatalogRef.ВнешниеЦКК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиОборудования</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиОборудования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетчикиПроизводительностиРолей</name>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиОборудования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ДоступностьСайта/Forms/ДоступностьРесурсов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЭтотОбъект.Заголовок = "Список доступности ресурсов";
    
    ПараметрыСписка = ЭтотОбъект.Список.Параметры;
	ПараметрыСписка.УстановитьЗначениеПараметра("ТипЗначенияПубликация", ТипЗнч(Справочники.Публикации.ПустаяСсылка()));
    ПараметрыСписка.УстановитьЗначениеПараметра("ТипЗначенияОборудование", ТипЗнч(Справочники.Оборудование.ПустаяСсылка()));
    ПараметрыСписка.УстановитьЗначениеПараметра("ТипЗначенияОбъектКонтроля", ТипЗнч(Справочники.ОбъектыКонтроля.ПустаяСсылка()));
    ПараметрыСписка.УстановитьЗначениеПараметра("ТипЗначенияАгентКИП", ТипЗнч(Справочники.АгентыКИП.ПустаяСсылка()));
    ПараметрыСписка.УстановитьЗначениеПараметра("Доступен", "Доступен");
    ПараметрыСписка.УстановитьЗначениеПараметра("НеДоступен", "Недоступен");
    ПараметрыСписка.УстановитьЗначениеПараметра("НетДанныхПоДоступности", "Нет данных по доступности");
    ПараметрыСписка.УстановитьЗначениеПараметра("Публикация", "Публикация");
    ПараметрыСписка.УстановитьЗначениеПараметра("ИнформационнаяБаза", "Информационная база");
    ПараметрыСписка.УстановитьЗначениеПараметра("Оборудование", "Оборудование (ping)");
    ПараметрыСписка.УстановитьЗначениеПараметра("КонтрольПодключений", Справочники.ВидыКонтрольныхПроцедур.КонтрольПодключений());	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ЭтотОбъект.Список.Отбор.Элементы.Очистить();
	
	Для Каждого ТекЭлемент Из ВыбранноеЗначение.Элементы Цикл
		НовЭлемент = ЭтотОбъект.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		НовЭлемент.ЛевоеЗначение = ТекЭлемент.ЛевоеЗначение;
		НовЭлемент.Использование = ТекЭлемент.Использование;
		НовЭлемент.ПравоеЗначение = ТекЭлемент.ПравоеЗначение;
	КонецЦикла;
	
	СохранитьОтбор(НастройкаОтбораСписка, ЭтотОбъект.Список.Отбор);	
	
	ЭтотОбъект.ОтборПредставление = Строка(ЭтотОбъект.Список.Отбор);
	
	ЭтотОбъект.Элементы.Список.Обновить();
    
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
    
    Если ЗначениеЗаполнено(НастройкаОтбораСписка) Тогда
		ЭтотОбъект.Список.Отбор.Элементы.Очистить();
		
		НовыйОтбор = ВосстановитьОтбор(НастройкаОтбораСписка);
		Для Каждого ТекЭлемент Из НовыйОтбор.Элементы Цикл
			НовЭлемент = ЭтотОбъект.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовЭлемент.ЛевоеЗначение = ТекЭлемент.ЛевоеЗначение;
			НовЭлемент.Использование = ТекЭлемент.Использование;
			НовЭлемент.ВидСравнения = ТекЭлемент.ВидСравнения;
			НовЭлемент.ПравоеЗначение = ТекЭлемент.ПравоеЗначение;
		КонецЦикла;
		
		ЭтотОбъект.ОтборПредставление = Строка(ЭтотОбъект.Список.Отбор);

    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьРесурс(Команда)
	ОткрытьФорму("Справочник.Публикации.Форма.ФормаЭлемента");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРесурсПинг(Команда)
	ОткрытьФорму("Справочник.Оборудование.Форма.ФормаЭлемента");
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПубликации(Команда)
	ОткрытьФорму("Справочник.Публикации.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьОборудование(Команда)
	ОткрытьФорму("Справочник.Оборудование.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьИнформационныеБазы(Команда)
	ОткрытьФорму("Справочник.КонтрольныеПроцедуры.Форма.ФормаСпискаКонтрольПодключений");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДанные(Команда)
	Если ТипЗнч(ЭтотОбъект.Элементы.Список.ТекущиеДанные.Ресурс) = Тип("СправочникСсылка.ОбъектыКонтроля") Тогда
		ПараметрыОткрытия = Новый Структура("ИнформационнаяБаза", ЭтотОбъект.Элементы.Список.ТекущиеДанные.Ресурс);
		ОткрытьФорму("РегистрСведений.ДоступностьИнформационныхБаз.Форма.ФормаСписка", ПараметрыОткрытия);	
	ИначеЕсли ТипЗнч(ЭтотОбъект.Элементы.Список.ТекущиеДанные.Ресурс) = Тип("СправочникСсылка.Оборудование") Тогда
		ПараметрыОткрытия = Новый Структура("РабочийСервер", ЭтотОбъект.Элементы.Список.ТекущиеДанные.Ресурс);
		ОткрытьФорму("РегистрСведений.ДоступностьОборудования.Форма.ФормаСписка", ПараметрыОткрытия);
	Иначе
		ПараметрыОткрытия = Новый Структура("Ресурс", ЭтотОбъект.Элементы.Список.ТекущиеДанные.Ресурс);
		ОткрытьФорму("РегистрСведений.ДоступностьСайта.Форма.ФормаСписка", ПараметрыОткрытия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборСписка(Команда)
	ОткрытьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтбор(Команда)
	
	ЭтотОбъект.Список.Отбор.Элементы.Очистить();
	НастройкаОтбораСписка = "";
	ЭтотОбъект.ОтборПредставление = Строка(ЭтотОбъект.Список.Отбор);
	ЭтотОбъект.Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияВыбранным(Команда)
    
    ДанныеДляРедактирования = Новый Массив;
    
    Для Каждого ТекСтрока Из ЭтотОбъект.Элементы.Список.ВыделенныеСтроки Цикл
        
        ДанныеСтроки = ЭтотОбъект.Элементы.Список.ДанныеСтроки(ТекСтрока);
        ДанныеДляРедактирования.Добавить(ДанныеСтроки.Ресурс);
        
    КонецЦикла;
    
    
    ПараметрыОткрытия = Новый Структура("Ресурсы", ДанныеДляРедактирования);
    
    ТекДанные = ЭтотОбъект.Элементы.Список.ТекущиеДанные;
    ПараметрыОткрытия.Вставить("ВыполнятьКонтроль", ТекДанные.ВыполнятьКонтроль);
    ПараметрыОткрытия.Вставить("Таймаут", ТекДанные.Таймаут);
    ПараметрыОткрытия.Вставить("ПериодичностьКонтроля", ТекДанные.ПериодичностьКонтроля);
    ПараметрыОткрытия.Вставить("ПериодКонтроля", ТекДанные.ПериодКонтроля);
    ПараметрыОткрытия.Вставить("МинимальныйПроцентДоступности", ТекДанные.МинимальныйПроцентДоступности);
    ПараметрыОткрытия.Вставить("ДопустимоНетДанных", ТекДанные.ДопустимоНетДанных);
    
    ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьЗначенияВыбраннымЗакрытие", ЭтотОбъект);
    ОткрытьФорму("РегистрСведений.ДоступностьСайта.Форма.ФормаУстановитьЗначенияВыбранным", ПараметрыОткрытия,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТипЗнч(Элемент.ДанныеСтроки(ВыбраннаяСтрока).Ресурс) = Тип("СправочникСсылка.ОбъектыКонтроля") Тогда
		КонтрольнаяПроцедураСсылка = ПолучитьКонтрольнуюПроцедуруПодключения(Элемент.ДанныеСтроки(ВыбраннаяСтрока).Ресурс);
		ПараметрыФормы = Новый Структура("Ключ", КонтрольнаяПроцедураСсылка);
        ПараметрыФормы.Вставить("Источник", Элемент.ДанныеСтроки(ВыбраннаяСтрока).Источник);
		ОткрытьФорму("Справочник.КонтрольныеПроцедуры.Форма.ФормаЭлементаКонтрольПодключений", ПараметрыФормы);
		СтандартнаяОбработка = Ложь;
	ИначеЕсли ТипЗнч(Элемент.ДанныеСтроки(ВыбраннаяСтрока).Ресурс) = Тип("СправочникСсылка.Оборудование") Тогда
		ПараметрыФормы = Новый Структура("Ключ", Элемент.ДанныеСтроки(ВыбраннаяСтрока).Ресурс);
		ОткрытьФорму("Справочник.Оборудование.ФормаОбъекта", ПараметрыФормы);
		СтандартнаяОбработка = Ложь;
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", Элемент.ДанныеСтроки(ВыбраннаяСтрока).Ресурс);
		ОткрытьФорму("Справочник.Публикации.Форма.ФормаЭлемента", ПараметрыФормы);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьПроверкуНемедленно(Команда)
	
	ВыполнитьПроверкуНемедленноНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроверкуНемедленноНаСервере ()
	
	ПубликацииКонтрольДоступности.ВыполнитьПроверкуПубликаций();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКонтрольнуюПроцедуруПодключения(ОбъектКонтроляСсылка)
	Возврат Справочники.ОбъектыКонтроля.ПолучитьКонтрольПодключений(ОбъектКонтроляСсылка);
КонецФункции

&НаКлиенте
Процедура ОтборПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	ОткрытьОтбор();
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтбор()
	ПараметрыОткрытия = Новый Структура("Отбор", ЭтотОбъект.Список.Отбор);
	ОткрытьФорму("РегистрСведений.ДоступностьСайта.Форма.ФормаБыстрогоОтбора", ПараметрыОткрытия, ЭтотОбъект);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьОтбор(НастройкаОтбораСписка, Знач Отбор)
	
	Поток = Новый ЗаписьXML();
	Поток.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(Поток, Отбор);
	НастройкаОтбораСписка = Поток.Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВосстановитьОтбор(НастройкаОтбораСписка)
	
	Поток = Новый ЧтениеXML();
	Поток.УстановитьСтроку(НастройкаОтбораСписка);
	НовыйОтбор = СериализаторXDTO.ПрочитатьXML(Поток);
	Поток.Закрыть();
	
	Возврат НовыйОтбор;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьРесурсИнформационнуюБазу(Команда)
	ОткрытьФорму("Справочник.КонтрольныеПроцедуры.Форма.ФормаЭлементаКонтрольПодключений");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияВыбраннымЗакрытие(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
    
    Если РезультатЗакрытия = "Обновить" Тогда
        ЭтотОбъект.Элементы.Список.Обновить();
    КонецЕсли;
        
КонецПроцедуры

#КонецОбласти
